french/index.org
#+BEGIN_COMMENT
.. title: French learners stuff
.. slug: french
.. date: 2020-09-30 21:42:32 UTC+02:00
.. tags: 
.. category: 
.. link:  
.. description: 
.. type: text

#+END_COMMENT
#+OPTIONS: toc:t

** Podcasts

*** Learning

- [[https://innerfrench.com/][innerFrench]] These podcasts helped me get
  going with French. Hugo speaks quite slowly in the first few podcasts,
  so that you gain confidence with understanding French. He discusses
  many different topics; listening to a podcast twice is still nice.
- [[https://www.francaisauthentique.com/][Français Authentique]] Johan Tekfak
  explains all sorts of things about the French language and personal
  development. The idea is the same as with innerFrench: teach a
  language to students by talking about all sorts of topics, rather than
  focus on grammar or vocabulary. There is a youtube channel too.
- [[https://www.francaisavecpierre.com/][Français avec Pierre]] Another
  podcast for French learners. Has a youtube channel too.

*** Science


- [[https://www.franceculture.fr/emissions/la-conversation-scientifique][La conversation scientifique]]
- [[https://www.franceculture.fr/emissions/la-methode-scientifique][La  Méthode scientifique]]
- [[https://www.20minutes.fr/podcast/sixieme-science/][Sixième Science]]- [[https://interstices.info/?s=&fwp_type=podcast][Podcasts
  Interstices]]: nice and short interviews mostly on computer science
  topics
- [[https://www.franceinter.fr/emissions/sur-les-epaules-de-darwin][Sur  les épaules de Darwin]] Nice topics, but I could not stand the voice
  of the presenter.
- [[https://www.chosesasavoir.com/][Choses a savoir]] There are several
  other podcasts associated with this podcasts, about health, history,
  one for children, and some more.

*** Other stuff

- [[https://changemavie.com/][Change ma vie]] The author speaks about
  personel development. I mainly listen to it because she has a clear
  voice. She speaks a bit fast at times, but since she pronouces very
  clearly, it is still easy to understand.
- Les Bonnes choses: discussions on cooking
- L'air du son: interviews on voice and speaking

** Youtube

*** Learning

- [[https://www.youtube.com/channel/UCI4xp8qHD1MDErkqxb1dPbA][innerFrench]]
  Hugo Cotton really helps to understand French.

*** Science

- [[https://www.youtube.com/user/cestpassorcierftv][C'est pas sorcier]]
  A channel for children. Discusses an enormous range of topics.
- [[https://www.youtube.com/channel/UCOuIgj0CYCXCvjWywjDbauw][Chat Sceptique]]: Cartoon, statistics explained to a cat.
- [[https://www.youtube.com/channel/UCgkhWgBGRp0sdFy2MHDWfSg][El Jj]]:   mathematics
- [[https://youtu.be/asHiYmdk9W0][Fouloscopie]] Discussions of crowd   behavior
- [[https://www.youtube.com/channel/UCMFcMhePnH4onVHt2-ItPZw][Hygiène Mentale]] A sceptical look on things.
- [[https://www.youtube.com/channel/UCWYxQt9Y3y2CDzXLf2K7xCA][Lanterne  Cosmique]] I don't know how to characterize this channel, but I find
  the topics nice.
- [[https://www.youtube.com/channel/UCrRKlEDktKeraMTgAN_DIzw][Le Monde De Jamy]] Similar to C'est pas sorcier, but only with Jamy
- [[https://www.youtube.com/channel/UCwIigJTGRHqgUdWO8Fx9Tdg][Les idées froides]]: A channel on physics, mainly relativity related
- [[https://www.youtube.com/channel/UC4PasDd25MXqlXBogBw9CAg][Mickaël  Launay]] Maths in French.
- [[https://www.youtube.com/channel/UCaNlbnghtwlsGF-KzAFThqA][ScienceEtonnante]]
  Science questions discussed by a fellow phycisist.
- [[https://www.youtube.com/channel/UCKtG_lXZk4pRJkapfK0eprA][Tu mourras   moins bête]]: Funny cartoons on science questions.
- [[https://www.youtube.com/playlist?list=PLA7FEDF4FDFC667F1][Une   promenade mathématique... Dimensions]] and the
  [[http://www.dimensions-math.org/][website]] that goes with it.
- [[https://www.youtube.com/channel/UCAxljKT0ujiJZhGC8Ood7mw][Zeste de  Science]]: Very nicely made, general science channel.
- [[https://www.youtube.com/channel/UCcziTK2NKeWtWQ6kB5tmQ8Q][e-penser]]:  general science questions, the guy speaks pretty fast. 

*** Culture
    :PROPERTIES:
    :CUSTOM_ID: culture
    :END:

- [[https://www.youtube.com/channel/UCRWhwFtif1T5mpFokTUnu6g][Des  Racines et des Ailes]]: Nice movies about architecture, landscape,
  French regions, and so on.
- [[https://www.youtube.com/channel/UC781HeW_j67wRZ5pqSmLpHQ][1000 idées  de culture générale]] Philosophy with French subtitles. The author
  speaks relatively slowly so its easy to follow.

** Audio books

Via Librivox you can find and download tonnes of free audio books. *
[[https://librivox.org/les-mille-et-une-nuits-tome-premier-by-anonymous/][Mille et une nuit]]

** Parallel translations

I learned a lot from parallel translations.

- [[https://bibleforchildren.org/][The bible for kids]] Very useful. I  read the stories as a kid, so I knew the stories already. That
  helped me lot in guessing the meaning of words I didn't know, so that
  I could just continue reading, rather than spend hours with a
  dictionary.

** Vocabulary

- [[https://ankiweb.net/about][Anki]] is very useful to learn words. It  is based on spaced repetition; if you're interested just search for
  this concept.
