french/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>French learners stuff | Nicky's site</title>
<link href="../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../rss.xml">
<link rel="canonical" href="https://ndvanforeest.github.io/french/">
<!--[if lt IE 9]><![endif]--><link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css">
<link rel="stylesheet" href="https://cdn.rawgit.com/jpswalsh/academicons/master/css/academicons.min.css">
<meta name="author" content="Nicky van Foreest">
<meta property="og:site_name" content="Nicky's site">
<meta property="og:title" content="French learners stuff">
<meta property="og:url" content="https://ndvanforeest.github.io/french/">
<meta property="og:description" content="Table of Contents


Podcasts

Learning
Science
Other stuff


Youtube

Learning
Science
Culture


Audio books
Parallel translations
Vocabulary





Podcasts



Learning


innerFrench These podcasts hel">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-09-30T21:42:32+02:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../">

            <span id="blog-title">Nicky's site</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../bio/" class="nav-link">Bio</a>
                </li>
<li class="nav-item">
<a href="../books/" class="nav-link">Books</a>
                </li>
<li class="nav-item">
<a href="../writings/" class="nav-link">Posts</a>
                </li>
<li class="nav-item">
<a href="../presentations/" class="nav-link">Presentations</a>
                </li>
<li class="nav-item">
<a href="../sites/" class="nav-link">Sites</a>
                </li>
<li class="nav-item">
<a href="../tools/" class="nav-link">Tools</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text storypage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">French learners stuff</a></h1>

        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li>
<a href="#org32d6de7">Podcasts</a>
<ul>
<li><a href="#org150398e">Learning</a></li>
<li><a href="#orgf031969">Science</a></li>
<li><a href="#org3c70913">Other stuff</a></li>
</ul>
</li>
<li>
<a href="#org99face2">Youtube</a>
<ul>
<li><a href="#orgf51ef75">Learning</a></li>
<li><a href="#org4226f2d">Science</a></li>
<li><a href="#culture">Culture</a></li>
</ul>
</li>
<li><a href="#org6a6233e">Audio books</a></li>
<li><a href="#org9f061c5">Parallel translations</a></li>
<li><a href="#org8f80981">Vocabulary</a></li>
</ul>
</div>
</div>

<div id="outline-container-org32d6de7" class="outline-2">
<h2 id="org32d6de7">Podcasts</h2>
<div class="outline-text-2" id="text-org32d6de7">
</div>
<div id="outline-container-org150398e" class="outline-3">
<h3 id="org150398e">Learning</h3>
<div class="outline-text-3" id="text-org150398e">
<ul class="org-ul">
<li>
<a href="https://innerfrench.com/">innerFrench</a> These podcasts helped me get
going with French. Hugo speaks quite slowly in the first few podcasts,
so that you gain confidence with understanding French. He discusses
many different topics; listening to a podcast twice is still nice.</li>
<li>
<a href="https://www.francaisauthentique.com/">Français Authentique</a> Johan Tekfak
explains all sorts of things about the French language and personal
development. The idea is the same as with innerFrench: teach a
language to students by talking about all sorts of topics, rather than
focus on grammar or vocabulary. There is a youtube channel too.</li>
<li>
<a href="https://www.francaisavecpierre.com/">Français avec Pierre</a> Another
podcast for French learners. Has a youtube channel too.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf031969" class="outline-3">
<h3 id="orgf031969">Science</h3>
<div class="outline-text-3" id="text-orgf031969">
<ul class="org-ul">
<li><a href="https://www.franceculture.fr/emissions/la-conversation-scientifique">La conversation scientifique</a></li>
<li><a href="https://www.franceculture.fr/emissions/la-methode-scientifique">La  Méthode scientifique</a></li>
<li>
<a href="https://www.20minutes.fr/podcast/sixieme-science/">Sixième Science</a>- <a href="https://interstices.info/?s=&amp;fwp_type=podcast">Podcasts
Interstices</a>: nice and short interviews mostly on computer science
topics</li>
<li>
<a href="https://www.franceinter.fr/emissions/sur-les-epaules-de-darwin">Sur  les épaules de Darwin</a> Nice topics, but I could not stand the voice
of the presenter.</li>
<li>
<a href="https://www.chosesasavoir.com/">Choses a savoir</a> There are several
other podcasts associated with this podcasts, about health, history,
one for children, and some more.</li>
</ul>
</div>
</div>

<div id="outline-container-org3c70913" class="outline-3">
<h3 id="org3c70913">Other stuff</h3>
<div class="outline-text-3" id="text-org3c70913">
<ul class="org-ul">
<li>
<a href="https://changemavie.com/">Change ma vie</a> The author speaks about
personel development. I mainly listen to it because she has a clear
voice. She speaks a bit fast at times, but since she pronouces very
clearly, it is still easy to understand.</li>
<li>Les Bonnes choses: discussions on cooking</li>
<li>L'air du son: interviews on voice and speaking</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org99face2" class="outline-2">
<h2 id="org99face2">Youtube</h2>
<div class="outline-text-2" id="text-org99face2">
</div>
<div id="outline-container-orgf51ef75" class="outline-3">
<h3 id="orgf51ef75">Learning</h3>
<div class="outline-text-3" id="text-orgf51ef75">
<ul class="org-ul">
<li>
<a href="https://www.youtube.com/channel/UCI4xp8qHD1MDErkqxb1dPbA">innerFrench</a>
Hugo Cotton really helps to understand French.</li>
</ul>
</div>
</div>

<div id="outline-container-org4226f2d" class="outline-3">
<h3 id="org4226f2d">Science</h3>
<div class="outline-text-3" id="text-org4226f2d">
<ul class="org-ul">
<li>
<a href="https://www.youtube.com/user/cestpassorcierftv">C'est pas sorcier</a>
A channel for children. Discusses an enormous range of topics.</li>
<li>
<a href="https://www.youtube.com/channel/UCOuIgj0CYCXCvjWywjDbauw">Chat Sceptique</a>: Cartoon, statistics explained to a cat.</li>
<li>
<a href="https://www.youtube.com/channel/UCgkhWgBGRp0sdFy2MHDWfSg">El Jj</a>:   mathematics</li>
<li>
<a href="https://youtu.be/asHiYmdk9W0">Fouloscopie</a> Discussions of crowd   behavior</li>
<li>
<a href="https://www.youtube.com/channel/UCMFcMhePnH4onVHt2-ItPZw">Hygiène Mentale</a> A sceptical look on things.</li>
<li>
<a href="https://www.youtube.com/channel/UCWYxQt9Y3y2CDzXLf2K7xCA">Lanterne  Cosmique</a> I don't know how to characterize this channel, but I find
the topics nice.</li>
<li>
<a href="https://www.youtube.com/channel/UCrRKlEDktKeraMTgAN_DIzw">Le Monde De Jamy</a> Similar to C'est pas sorcier, but only with Jamy</li>
<li>
<a href="https://www.youtube.com/channel/UCwIigJTGRHqgUdWO8Fx9Tdg">Les idées froides</a>: A channel on physics, mainly relativity related</li>
<li>
<a href="https://www.youtube.com/channel/UC4PasDd25MXqlXBogBw9CAg">Mickaël  Launay</a> Maths in French.</li>
<li>
<a href="https://www.youtube.com/channel/UCaNlbnghtwlsGF-KzAFThqA">ScienceEtonnante</a>
Science questions discussed by a fellow phycisist.</li>
<li>
<a href="https://www.youtube.com/channel/UCKtG_lXZk4pRJkapfK0eprA">Tu mourras   moins bête</a>: Funny cartoons on science questions.</li>
<li>
<a href="https://www.youtube.com/playlist?list=PLA7FEDF4FDFC667F1">Une   promenade mathématique… Dimensions</a> and the
<a href="http://www.dimensions-math.org/">website</a> that goes with it.</li>
<li>
<a href="https://www.youtube.com/channel/UCAxljKT0ujiJZhGC8Ood7mw">Zeste de  Science</a>: Very nicely made, general science channel.</li>
<li>
<a href="https://www.youtube.com/channel/UCcziTK2NKeWtWQ6kB5tmQ8Q">e-penser</a>:  general science questions, the guy speaks pretty fast.</li>
</ul>
</div>
</div>

<div id="outline-container-culture" class="outline-3">
<h3 id="culture">Culture</h3>
<div class="outline-text-3" id="text-culture">
<ul class="org-ul">
<li>
<a href="https://www.youtube.com/channel/UCRWhwFtif1T5mpFokTUnu6g">Des  Racines et des Ailes</a>: Nice movies about architecture, landscape,
French regions, and so on.</li>
<li>
<a href="https://www.youtube.com/channel/UC781HeW_j67wRZ5pqSmLpHQ">1000 idées  de culture générale</a> Philosophy with French subtitles. The author
speaks relatively slowly so its easy to follow.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6a6233e" class="outline-2">
<h2 id="org6a6233e">Audio books</h2>
<div class="outline-text-2" id="text-org6a6233e">
<p>
Via Librivox you can find and download tonnes of free audio books. *
<a href="https://librivox.org/les-mille-et-une-nuits-tome-premier-by-anonymous/">Mille et une nuit</a>
</p>
</div>
</div>

<div id="outline-container-org9f061c5" class="outline-2">
<h2 id="org9f061c5">Parallel translations</h2>
<div class="outline-text-2" id="text-org9f061c5">
<p>
I learned a lot from parallel translations.
</p>

<ul class="org-ul">
<li>
<a href="https://bibleforchildren.org/">The bible for kids</a> Very useful. I  read the stories as a kid, so I knew the stories already. That
helped me lot in guessing the meaning of words I didn't know, so that
I could just continue reading, rather than spend hours with a
dictionary.</li>
</ul>
</div>
</div>

<div id="outline-container-org8f80981" class="outline-2">
<h2 id="org8f80981">Vocabulary</h2>
<div class="outline-text-2" id="text-org8f80981">
<ul class="org-ul">
<li>
<a href="https://ankiweb.net/about">Anki</a> is very useful to learn words. It  is based on spaced repetition; if you're interested just search for
this concept.</li>
</ul>
</div>
</div>
    </div>
    

</article><!--End of body content--><footer id="footer"><div class="text-center">
<p>
<span class="fa-stack">
  <a href="https://github.com/ndvanforeest">
    <i class="fa fa-github-square fa-stack-2x"></i>
  </a>
</span>
<span class="fa-stack">
  <a href="http://scholar.google.com/citations?user=IEjX_w4AAAAJ">
     <i class="ai ai-google-scholar-square ai-2x"></i>
  </a>
</span>
<span class="fa-stack">
  <a href="https://orcid.org/0000-0001-5428-1723">
     <i class="ai ai-orcid-square ai-2x"></i>
  </a>
</span>
<span class="fa-stack">
  <a href="mailto:vanforeest@gmail.com">
    <i class="fa fa-square fa-stack-2x"></i>
    <i class="fa fa-envelope fa-inverse fa-stack-1x"></i>
  </a>
</span>
</p>
<p>
  Contents © 2024  Nicky van Foreest
  —
  
  —
  Powered by <a href="https://getnikola.com" rel="nofollow">Nikola</a>
</p>
</div>

            
            
        </footer>
</div>
</div>


        <script src="../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>
